{
  "categories": [
    {
      "name": "General",
      "links": [
        {
          "title": "3x3 SEO tips for JavaScript web apps",
          "url": "https://www.youtube.com/watch?v=y1UzfahXfao&ab_channel=GoogleChromeDevelopers",
          "excerpt": "Learn three basic SEO tips for Angular, React, and Vue.js web apps.",
          "source": "Youtube"
        },
        {
          "title": "Machine Learning & Text Analysis",
          "url": "https://www.youtube.com/watch?v=y1UzfahXfao&ab_channel=GoogleChromeDevelopers",
          "excerpt": "Text analysis is the process of obtaining valuable insights from texts. ML can work with different types of textual information such as social media posts, messages, and emails. Special software helps to preprocess and analyze this data.",
          "source": "Blog"
        },
        {
          "title": "Break a forEach Loop with JavaScript",
          "url": "https://davidwalsh.name/javascript-array-tricks-3",
          "excerpt": "He recently ran into another JavaScript trick that blew my mind: how to break a forEach loop, shared by Andrea Giammarchi!",
          "source": "Blog"
        },
        {
          "title": "Flappy Bird in JavaScript with 25 Lines of Code",
          "url": "https://www.youtube.com/watch?v=M45iFPVdtj0&ab_channel=CodingTech",
          "excerpt": "In this tutorial he takes you on the callenge to code a flappy bird clone in a few lines of code as possible.The starting point is an empty HTML canvas and you can follow along all the way to a complete game.",
          "source": "Youtube"
        },
        {
          "title": "What's new in DevTools",
          "url": "https://www.youtube.com/watch?v=QsOF9SJJdAA&ab_channel=GoogleChromeDevelopers",
          "excerpt": "An overview of the latest and greatest features in Chrome DevTools.",
          "source": "Youtube"
        },
        {
          "title": "Canvas2D is getting an update",
          "url": "https://www.youtube.com/watch?v=dfOKFSDG7IM&ab_channel=GoogleChromeDevelopers",
          "excerpt": "Your good, old friend the Canvas2D API has been improving and is worth another look. Hear about all the new features that have been added to the spec.",
          "source": "Youtube"
        },
        {
          "title": "A web framework for building 3D/AR/VR experiences",
          "url": "https://aframe.io/",
          "excerpt": "Make 3D worlds with HTML and Entity-Component For Quest, Rift, WMR, SteamVR, mobile, desktop.",
          "source": "Product"
        },
        {
          "title": "Introduction to Erlang",
          "url": "https://serokell.io/blog/introduction-to-erlang",
          "excerpt": "While Erlang is not as popular as some modern programming languages, it quietly runs applications like WhatsApp and WeChat that serve massive amounts of users every day.",
          "source": "Blog"
        },
        {
          "title": "Why is processing a sorted array faster than processing an unsorted array?",
          "url": "https://stackoverflow.com/questions/11227809/why-is-processing-a-sorted-array-faster-than-processing-an-unsorted-array",
          "excerpt": "Here is a piece of C++ code that shows some very peculiar behavior. For some strange reason, sorting the data miraculously makes the code almost six times faster.",
          "source": "Nugget"
        },
        {
          "title": "30-Second Maths: The 50 Most Mind-Expanding Theories in Mathematics, Each Explained in Half a Minute",
          "url": "https://www.bookdepository.com/30-Second-Maths-Richard-J-Brown/9781785782886?ref=pd_gw_1_pd_gateway_1_1",
          "excerpt": "30 Second Maths takes the top 50 most engaging mathematical theories, and explains them to the general reader in half a minute, using nothing more than two pages, 200 words and one picture. Read at your own pace, and discover that maths can be more fascinating than you ever imagined.",
          "source": "Book"
        },
        {
          "title": "Pomodoro Technique",
          "url": "https://en.wikipedia.org/wiki/Pomodoro_Technique",
          "excerpt": "The Pomodoro Technique is a time management method developed by Francesco Cirillo in the late 1980s.",
          "source": "Nugget"
        }
      ]
    }
  ]
}
