{
  "categories": [
    {
      "name": "General",
      "links": [
        {
          "title": "Fast Inverse Square Root — A Quake III Algorithm",
          "excerpt": "In this video we will take an in depth look at the fast inverse square root and see where the mysterious number 0x5f3759df comes from. This algorithm became famous after id Software open sourced the engine for Quake III. On the way we will also learn about floating point numbers and newton's method.",
          "url": "https://www.youtube.com/watch?v=p8u_k2LIZyo",
          "tags": [
            "Video",
            "Quake III"
          ]
        },
        {
          "title": "Goodbye, Adobe Flash",
          "excerpt": "A thrice-weekly news show about tech + gaming culture.",
          "url": "https://www.youtube.com/watch?v=zV2VEOHNCJU",
          "tags": [
            "Video",
            "Tech news"
          ]
        },
        {
          "title": "The Year's Biggest Breakthroughs in Math and Computer Science",
          "excerpt": "For mathematicians and computer scientists, 2020 was full of discipline-spanning discoveries and celebrations of creativity. We'd like to take a moment to recognize some of these achievements.",
          "url": "https://www.youtube.com/watch?v=HL7DEkXV_60",
          "tags": [
            "Video",
            "Math and Computer Science"
          ]
        },
        {
          "title": "20 Award-Winning 13-Kilobyte JavaScript Games You Can Play in Your Browser",
          "excerpt": "In this article, I am going to show you 20 award-winning JavaScript games from the JS13kGames competition. So in other words, you're going to see 20 great examples of code from 20 insanely talented developers.",
          "url": "https://www.freecodecamp.org/news/20-award-winning-games-explained-code-breakdown/",
          "tags": [
            "Blog",
            "Games"
          ]
        },
        {
          "title": "Espressif's New ESP32-S3 Adds AI Features for IoT Devices",
          "excerpt": "The very last day of 2020 came with great news for ESP32 fans. The ubiquitous IoT microcontroller is getting a new family member — the ESP32-S3! Espressif's latest introduction includes an updated dual-core MCU, expanded GPIO, AI-focused instructions, and hardware-accelerated security features.",
          "url": "https://www.hackster.io/news/espressif-s-new-esp32-s3-adds-ai-features-for-iot-devices-b42b902abdf5",
          "tags": [
            "Product",
            "IoT"
          ]
        },
        {
          "title": "Radioactive materials were once sold in a STORE in the USSR!",
          "excerpt": "‘Izotopy’ was the name of a specialist store in Moscow that sold radioactive materials. And demand for them was very high. But how was such a thing possible?",
          "url": "https://www.rbth.com/history/333230-radioactive-materials-sold-ussr",
          "tags": [
            "Blog",
            "Russia"
          ]
        },
        {
          "title": "Welcome to 2021 with Joel Spolsky",
          "excerpt": "We are stepping into a new year with a very special guest, Stack Overflow's co-founder and chairman, Joel Spolsky. We chat programming, social networks, and what comes next.",
          "url": "https://stackoverflow.blog/2021/01/01/podcast-300-welcome-to-2021-with-joel-spolsky/",
          "tags": [
            "Podcast",
            "Stack Overflow"
          ]
        },
        {
          "title": "The AI companion who cares",
          "excerpt": "Replika is a #1 chatbot companion powered by artificial intelligence.",
          "url": "https://replika.ai/",
          "tags": [
            "Product",
            "AI Chatbot"
          ]
        }
      ]
    }
  ]
}
